workflows_to_upload/ReturnConnectingFlights_lock/AirPriceReq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
					<soapenv:Header/>
					<soapenv:Body>
						<air:AirPriceReq xmlns:air="http://www.travelport.com/schema/air_v42_0" AuthorizedBy="user" TargetBranch="P7090934" TraceId="trace">
							<com:BillingPointOfSaleInfo xmlns:com="http://www.travelport.com/schema/common_v42_0" OriginApplication="UAPI"/>
								<air:AirItinerary><air:AirSegment Key="CYxS9B3R2BKAORXLCAAAAA==" Group="0" Carrier="PK" FlightNumber="362" Origin="KHI" Destination="ISB" DepartureTime="2020-03-19T00:01:00.000+05:00" ArrivalTime="2020-03-19T01:56:00.000+05:00" FlightTime="115" Distance="689" ETicketability="Yes" Equipment="777" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="No polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="A" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G"/><air:AirSegment Key="CYxS9B3R2BKA3XXLCAAAAA==" Group="0" Carrier="PK" FlightNumber="653" Origin="ISB" Destination="LHE" DepartureTime="2020-03-19T20:00:00.000+05:00" ArrivalTime="2020-03-19T21:00:00.000+05:00" FlightTime="60" Distance="167" ETicketability="Yes" Equipment="ATR" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="No polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="A" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G"/><air:AirSegment Key="CYxS9B3R2BKAWRXLCAAAAA==" Group="1" Carrier="PK" FlightNumber="322" Origin="LHE" Destination="UET" DepartureTime="2020-04-23T12:35:00.000+05:00" ArrivalTime="2020-04-23T14:00:00.000+05:00" FlightTime="85" Distance="452" ETicketability="Yes" Equipment="320" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="No polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="A" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G"/><air:AirSegment Key="CYxS9B3R2BKAIaXLCAAAAA==" Group="1" Carrier="PK" FlightNumber="363" Origin="UET" Destination="KHI" DepartureTime="2020-04-24T12:20:00.000+05:00" ArrivalTime="2020-04-24T13:40:00.000+05:00" FlightTime="80" Distance="371" ETicketability="Yes" Equipment="320" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="No polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="A" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G"/></air:AirItinerary><com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v42_0" BookingTravelerRef="3" Code="ADT" /><com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v42_0" BookingTravelerRef="1" Code="CNN" Age="11" DOB="2009-02-28" /><com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v42_0" BookingTravelerRef="2" Code="INF" Age="1" DOB="2019-02-28" />
							<air:AirPricingCommand CabinClass="Economy"/>
						</air:AirPriceReq>
					</soapenv:Body>
				</soapenv:Envelope>